---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DifferentLabelsInMultiSegmentDim
source: html/11280a12-11d9-43be-949b-22502de304e6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.DifferentLabelsInMultiSegmentDim Property

All segments of a multi-segment dimension must be labeled the same.

## Syntax (C#)
```csharp
public static FailureDefinitionId DifferentLabelsInMultiSegmentDim { get; }
```